surface-water/simulations/RANS_3D/3mmx0.1mmXBump/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

//Phi for potentialFoam
    Phi
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-06;
        relTol          0.01;
    }


    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 4;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    residualControl
    {
        p               1e-4;
        U               1e-5;
        "(k|epsilon|omega)"   1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;//0.3;
    }

    equations
    {
        U               0.7;//0.7;
        k               0.7;
        epsilon         0.7;
        omega           0.7;
    }
}

cache
{
    grad(U);
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}
// ************************************************************************* //
