surface-water/simulations/RANS_3D/3mmx0.1mmXBump/system/residuals.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            residuals;
libs            ("libutilityFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;

// ************************************************************************* //
